# Используем официальный образ OpenJDK 21 с минимальным размером (slim)
FROM openjdk:21-jdk-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем JAR-файл, созданный Maven, в контейнер
# Предполагается, что твой артефакт называется demo-0.0.1-SNAPSHOT.jar
# и находится в папке target/ после сборки.
# Мы копируем его с именем app.jar для простоты.
COPY target/*.jar app.jar

# Открываем порт 8080, который будет использоваться приложением
EXPOSE 8080

# Определяем команду, которая будет выполнена при запуске контейнера.
# Это запуск JAR-файла.
ENTRYPOINT ["java", "-jar", "app.jar"]